Tekla Open API Reference for Tekla Structures 2025
DatabaseObject.IsSameDatabaseObject Method
 Returns true if the current object and the given object are referencing the same database object.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public virtual bool IsSameDatabaseObject(
	DatabaseObject Object
)
Public Overridable Function IsSameDatabaseObject (
	Object As DatabaseObject
) As Boolean
Parameters
Object
Type: Tekla.Structures.Drawing.DatabaseObject
The other object to be used.
Return Value
Type: Boolean
True if the objects are referencing the same database object.
See Also
Reference
DatabaseObject Class
Tekla.Structures.Drawing Namespace